
public class Variable_02 {

	public static void main(String[] args) {
		// 변수를 선언한 후 사용하는 방법
		// 1. 변수를 선언한 후, 값을 할당하는 방법
		int n1;
		n1 = 10;
		n1 = 100;
		System.out.printf("n1 = %d\n", n1);
		
		// 2. 변수의 선언과 동시에 값을 할당
		int n2 = 20;
		System.out.printf("n2 = %d\n", n2);
		
		// 3. 다수개의 변수를 동시에 선언하는 방법
		// (동일한 자료형의 변수를 다수개 선언할 수 있음)
		// 자료형 변수명1, 변수명2, ... , 변수명N;
		int n3, n4, n5;
		
		// 4. 다수개의 변수를 만들면서 값을 할당하는 방법
		// 자료형 변수명1 = 값1, 변수명2 = 값2, 변수명N = 값N
		int n6 = 33, n7 = 44, n8 = 55;
		
		// 5. 다수개의 변수를 선언할 때 일부분의 변수만 초기화가 가능
		int n9 = 99, n10, n11=111;
		
		

	}

}
